app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "tryuil;opjkhjkjk"], ["body", "jklljllklkl"], ["article_id", 2], ["created_at", "2019-04-20 16:32:16.336202"], ["updated_at", "2019-04-20 16:32:16.336202"], ["user_id", 4]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    @comment.user = current_user
    @comment.save